OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1777.h
#define _MD3CON1_CLSYNC         0x01
#define _MD3CON1_MD3CLSYNC      0x01
#define _MD3CON1_CLPOL          0x02
#define _MD3CON1_MD3CLPOL       0x02
#define _MD3CON1_CHSYNC         0x10
#define _MD3CON1_MD3CHSYNC      0x10
#define _MD3CON1_CHPOL          0x20
#define _MD3CON1_MD3CHPOL       0x20

//==============================================================================


//==============================================================================
//        MD3SRC Bits

extern __at(0x021D) __sfr MD3SRC;

typedef union
  {
  struct
    {
    unsigned MS0                : 1;
    unsigned MS1                : 1;
    unsigned MS2                : 1;
    unsigned MS3                : 1;
    unsigned MS4                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned MD3MS0             : 1;
    unsigned MD3MS1             : 1;
    unsigned MD3MS2             : 1;
    unsigned MD3MS3             : 1;
    unsigned MD3MS4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned MD3MS              : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned MS                 : 5;
    unsigned                    : 3;
    };
  } __MD3SRCbits_t;

extern __at(0x021D) volatile __MD3SRCbits_t MD3SRCbits;

#define _MD3SRC_MS0             0x01
#define _MD3SRC_MD3MS0          0x01
#define _MD3SRC_MS1             0x02
#define _MD3SRC_MD3MS1          0x02
#define _MD3SRC_MS2             0x04
#define _MD3SRC_MD3MS2          0x04
#define _MD3SRC_MS3             0x08
#define _MD3SRC_MD3MS3          0x08
#define _MD3SRC_MS4             0x10
#define _MD3SRC_MD3MS4          0x10

//==============================================================================


//==============================================================================
//        MD3CARL Bits

extern __at(0x021E) __sfr MD3CARL;

typedef union
  {
  struct
    {
    unsigned CL0                : 1;
    unsigned CL1                : 1;
    unsigned CL2                : 1;
    unsigned CL3                : 1;
    unsigned CL4                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned MD3CL0             : 1;
    unsigned MD3CL1             : 1;
    unsigned MD3CL2             : 1;
    unsigned MD3CL3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CL                 : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned MD3CL              : 4;
    unsigned                    : 4;
    };
  } __MD3CARLbits_t;

extern __at(0x021E) volatile __MD3CARLbits_t MD3CARLbits;

#define _MD3CARL_CL0            0x01
#define _MD3CARL_MD3CL0         0x01
#define _MD3CARL_CL1            0x02
#define _MD3CARL_MD3CL1         0x02
#define _MD3CARL_CL2            0x04
#define _MD3CARL_MD3CL2         0x04
#define _MD3CARL_CL3            0x08
#define _MD3CARL_MD3CL3         0x08
#define _MD3CARL_CL4            0x10

//==============================================================================


//==============================================================================
//        MD3CARH Bits

extern __at(0x021F) __sfr MD3CARH;

typedef union
  {
  struct
    {
    unsigned CH0                : 1;
    unsigned CH1                : 1;
    unsigned CH2                : 1;
    unsigned CH3                : 1;
    unsigned CH4                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned MD3CH0             : 1;
    unsigned MD3CH1             : 1;
    unsigned MD3CH2             : 1;
    unsigned MD3CH3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CH                 : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned MD3CH              : 4;
    unsigned                    : 4;
    };
  } __MD3CARHbits_t;

extern __at(0x021F) volatile __MD3CARHbits_t MD3CARHbits;

#define _MD3CARH_CH0            0x01
#define _MD3CARH_MD3CH0         0x01
#define _MD3CARH_CH1            0x02
#define _MD3CARH_MD3CH1         0x02
#define _MD3CARH_CH2            0x04
#define _MD3CARH_MD3CH2         0x04
#define _MD3CARH_CH3            0x08
#define _MD3CARH_MD3CH3         0x08
#define _MD3CARH_CH4            0x10

//==============================================================================


//==============================================================================
//        ODCONA Bits

extern __at(0x028C) __sfr ODCONA;

typedef struct
  {
  unsigned ODA0                 : 1;
  unsigned ODA1                 : 1;
  unsigned ODA2                 : 1;
  unsigned ODA3                 : 1;
  unsigned ODA4                 : 1;
  unsigned ODA5                 : 1;
  unsigned ODA6                 : 1;
  unsigned ODA7                 : 1;
  } __ODCONAbits_t;

extern __at(0x028C) volatile __ODCONAbits_t ODCONAbits;

#define _ODA0                   0x01
#define _ODA1                   0x02
#define _ODA2                   0x04
#define _ODA3                   0x08
#define _ODA4                   0x10
#define _ODA5                   0x20
#define _ODA6                   0x40
#define _ODA7                   0x80

//==============================================================================


//==============================================================================
//        ODCONB Bits

extern __at(0x028D) __sfr ODCONB;

typedef struct
  {
  unsigned ODB0                 : 1;
  unsigned ODB1                 : 1;
  unsigned ODB2                 : 1;
  unsigned ODB3                 : 1;
  unsigned ODB4                 : 1;
  unsigned ODB5                 : 1;
  unsigned ODB6                 : 1;
  unsigned ODB7                 : 1;
  } __ODCONBbits_t;

extern __at(0x028D) volatile __ODCONBbits_t ODCONBbits;

#define _ODB0                   0x01
#define _ODB1                   0x02
#define _ODB2                   0x04
#define _ODB3                   0x08
#define _ODB4                   0x10
#define _ODB5                   0x20
#define _ODB6                   0x40
#define _ODB7                   0x80

//==============================================================================


//==============================================================================
//        ODCONC Bits

extern __at(0x028E) __sfr ODCONC;

typedef struct
  {
  unsigned ODC0                 : 1;
  unsigned ODC1                 : 1;
  unsigned ODC2                 : 1;
  unsigned ODC3                 : 1;
  unsigned ODC4                 : 1;
  unsigned ODC5                 : 1;
  unsigned ODC6                 : 1;
  unsigned ODC7                 : 1;
  } __ODCONCbits_t;

