OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1777.h
extern __at(0x0298) __sfr CCP2CAP;

typedef union
  {
  struct
    {
    unsigned CTS0               : 1;
    unsigned CTS1               : 1;
    unsigned CTS2               : 1;
    unsigned CTS3               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP2CTS0           : 1;
    unsigned CCP2CTS1           : 1;
    unsigned CCP2CTS2           : 1;
    unsigned CCP2CTS3           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CTS                : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned CCP2CTS            : 4;
    unsigned                    : 4;
    };
  } __CCP2CAPbits_t;

extern __at(0x0298) volatile __CCP2CAPbits_t CCP2CAPbits;

#define _CCP2CAP_CTS0           0x01
#define _CCP2CAP_CCP2CTS0       0x01
#define _CCP2CAP_CTS1           0x02
#define _CCP2CAP_CCP2CTS1       0x02
#define _CCP2CAP_CTS2           0x04
#define _CCP2CAP_CCP2CTS2       0x04
#define _CCP2CAP_CTS3           0x08
#define _CCP2CAP_CCP2CTS3       0x08

//==============================================================================

extern __at(0x0299) __sfr CCPR7;
extern __at(0x0299) __sfr CCPR7L;
extern __at(0x029A) __sfr CCPR7H;

//==============================================================================
//        CCP7CON Bits

extern __at(0x029B) __sfr CCP7CON;

typedef union
  {
  struct
    {
    unsigned MODE0              : 1;
    unsigned MODE1              : 1;
    unsigned MODE2              : 1;
    unsigned MODE3              : 1;
    unsigned FMT                : 1;
    unsigned OUT                : 1;
    unsigned                    : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned CCP7MODE0          : 1;
    unsigned CCP7MODE1          : 1;
    unsigned CCP7MODE2          : 1;
    unsigned CCP7MODE3          : 1;
    unsigned CCP7FMT            : 1;
    unsigned CCP7OUT            : 1;
    unsigned                    : 1;
    unsigned CCP7EN             : 1;
    };

  struct
    {
    unsigned MODE               : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned CCP7MODE           : 4;
    unsigned                    : 4;
    };
  } __CCP7CONbits_t;

extern __at(0x029B) volatile __CCP7CONbits_t CCP7CONbits;

#define _CCP7CON_MODE0          0x01
#define _CCP7CON_CCP7MODE0      0x01
#define _CCP7CON_MODE1          0x02
#define _CCP7CON_CCP7MODE1      0x02
#define _CCP7CON_MODE2          0x04
#define _CCP7CON_CCP7MODE2      0x04
#define _CCP7CON_MODE3          0x08
#define _CCP7CON_CCP7MODE3      0x08
#define _CCP7CON_FMT            0x10
#define _CCP7CON_CCP7FMT        0x10
#define _CCP7CON_OUT            0x20
#define _CCP7CON_CCP7OUT        0x20
#define _CCP7CON_EN             0x80
#define _CCP7CON_CCP7EN         0x80

//==============================================================================


//==============================================================================
//        CCP7CAP Bits

extern __at(0x029C) __sfr CCP7CAP;

typedef union
  {
  struct
    {
    unsigned CTS0               : 1;
    unsigned CTS1               : 1;
    unsigned CTS2               : 1;
    unsigned CTS3               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP7CTS0           : 1;
    unsigned CCP7CTS1           : 1;
    unsigned CCP7CTS2           : 1;
    unsigned CCP7CTS3           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CTS                : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned CCP7CTS            : 4;
    unsigned                    : 4;
    };
  } __CCP7CAPbits_t;

extern __at(0x029C) volatile __CCP7CAPbits_t CCP7CAPbits;

#define _CCP7CAP_CTS0           0x01
#define _CCP7CAP_CCP7CTS0       0x01
#define _CCP7CAP_CTS1           0x02
#define _CCP7CAP_CCP7CTS1       0x02
#define _CCP7CAP_CTS2           0x04
#define _CCP7CAP_CCP7CTS2       0x04
#define _CCP7CAP_CTS3           0x08
#define _CCP7CAP_CCP7CTS3       0x08

//==============================================================================


//==============================================================================
//        CCPTMRS1 Bits

extern __at(0x029E) __sfr CCPTMRS1;

typedef union
  {
  struct
    {
    unsigned C1TSEL0            : 1;
    unsigned C1TSEL1            : 1;
    unsigned C2TSEL0            : 1;
    unsigned C2TSEL1            : 1;
    unsigned C7TSEL0            : 1;
    unsigned C7TSEL1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C1TSEL             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned C2TSEL             : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned C7TSEL             : 2;
    unsigned                    : 2;
    };
  } __CCPTMRS1bits_t;

extern __at(0x029E) volatile __CCPTMRS1bits_t CCPTMRS1bits;

#define _C1TSEL0                0x01
#define _C1TSEL1                0x02
#define _C2TSEL0                0x04
#define _C2TSEL1                0x08
#define _C7TSEL0                0x10
#define _C7TSEL1                0x20

//==============================================================================


//==============================================================================
//        CCPTMRS2 Bits

extern __at(0x029F) __sfr CCPTMRS2;

typedef union
  {
  struct
    {
    unsigned P3TSEL0            : 1;
    unsigned P3TSEL1            : 1;
    unsigned P4TSEL0            : 1;
    unsigned P4TSEL1            : 1;
    unsigned P9TSEL0            : 1;
    unsigned P9TSEL1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P3TSEL             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned P4TSEL             : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned P9TSEL             : 2;
    unsigned                    : 2;
    };
  } __CCPTMRS2bits_t;

extern __at(0x029F) volatile __CCPTMRS2bits_t CCPTMRS2bits;

