OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1777.h
#define _PWM10DCL_DC0           0x40
#define _PWM10DCL_PWM10DC0      0x40
#define _PWM10DCL_PWMPW0        0x40
#define _PWM10DCL_DC1           0x80
#define _PWM10DCL_PWM10DC1      0x80
#define _PWM10DCL_PWMPW1        0x80

//==============================================================================


//==============================================================================
//        PWM10DCH Bits

extern __at(0x061E) __sfr PWM10DCH;

typedef union
  {
  struct
    {
    unsigned DC2                : 1;
    unsigned DC3                : 1;
    unsigned DC4                : 1;
    unsigned DC5                : 1;
    unsigned DC6                : 1;
    unsigned DC7                : 1;
    unsigned DC8                : 1;
    unsigned DC9                : 1;
    };

  struct
    {
    unsigned PWM10DC2           : 1;
    unsigned PWM10DC3           : 1;
    unsigned PWM10DC4           : 1;
    unsigned PWM10DC5           : 1;
    unsigned PWM10DC6           : 1;
    unsigned PWM10DC7           : 1;
    unsigned PWM10DC8           : 1;
    unsigned PWM10DC9           : 1;
    };

  struct
    {
    unsigned PWMPW2             : 1;
    unsigned PWMPW3             : 1;
    unsigned PWMPW4             : 1;
    unsigned PWMPW5             : 1;
    unsigned PWMPW6             : 1;
    unsigned PWMPW7             : 1;
    unsigned PWMPW8             : 1;
    unsigned PWMPW9             : 1;
    };
  } __PWM10DCHbits_t;

extern __at(0x061E) volatile __PWM10DCHbits_t PWM10DCHbits;

#define _PWM10DCH_DC2           0x01
#define _PWM10DCH_PWM10DC2      0x01
#define _PWM10DCH_PWMPW2        0x01
#define _PWM10DCH_DC3           0x02
#define _PWM10DCH_PWM10DC3      0x02
#define _PWM10DCH_PWMPW3        0x02
#define _PWM10DCH_DC4           0x04
#define _PWM10DCH_PWM10DC4      0x04
#define _PWM10DCH_PWMPW4        0x04
#define _PWM10DCH_DC5           0x08
#define _PWM10DCH_PWM10DC5      0x08
#define _PWM10DCH_PWMPW5        0x08
#define _PWM10DCH_DC6           0x10
#define _PWM10DCH_PWM10DC6      0x10
#define _PWM10DCH_PWMPW6        0x10
#define _PWM10DCH_DC7           0x20
#define _PWM10DCH_PWM10DC7      0x20
#define _PWM10DCH_PWMPW7        0x20
#define _PWM10DCH_DC8           0x40
#define _PWM10DCH_PWM10DC8      0x40
#define _PWM10DCH_PWMPW8        0x40
#define _PWM10DCH_DC9           0x80
#define _PWM10DCH_PWM10DC9      0x80
#define _PWM10DCH_PWMPW9        0x80

//==============================================================================


//==============================================================================
//        PWM10CON Bits

extern __at(0x061F) __sfr PWM10CON;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned POL                : 1;
    unsigned OUT                : 1;
    unsigned                    : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM10POL           : 1;
    unsigned PWM10OUT           : 1;
    unsigned                    : 1;
    unsigned PWM10EN            : 1;
    };
  } __PWM10CONbits_t;

extern __at(0x061F) volatile __PWM10CONbits_t PWM10CONbits;

#define _PWM10CON_POL           0x10
#define _PWM10CON_PWM10POL      0x10
#define _PWM10CON_OUT           0x20
#define _PWM10CON_PWM10OUT      0x20
#define _PWM10CON_EN            0x80
#define _PWM10CON_PWM10EN       0x80

//==============================================================================


//==============================================================================
//        COG1PHR Bits

extern __at(0x068D) __sfr COG1PHR;

typedef union
  {
  struct
    {
    unsigned PHR0               : 1;
    unsigned PHR1               : 1;
    unsigned PHR2               : 1;
    unsigned PHR3               : 1;
    unsigned PHR4               : 1;
    unsigned PHR5               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G1PHR0             : 1;
    unsigned G1PHR1             : 1;
    unsigned G1PHR2             : 1;
    unsigned G1PHR3             : 1;
    unsigned G1PHR4             : 1;
    unsigned G1PHR5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G1PHR              : 6;
    unsigned                    : 2;
    };

  struct
    {
    unsigned PHR                : 6;
    unsigned                    : 2;
    };
  } __COG1PHRbits_t;

extern __at(0x068D) volatile __COG1PHRbits_t COG1PHRbits;

#define _PHR0                   0x01
#define _G1PHR0                 0x01
#define _PHR1                   0x02
#define _G1PHR1                 0x02
#define _PHR2                   0x04
#define _G1PHR2                 0x04
#define _PHR3                   0x08
#define _G1PHR3                 0x08
#define _PHR4                   0x10
#define _G1PHR4                 0x10
#define _PHR5                   0x20
#define _G1PHR5                 0x20

//==============================================================================


//==============================================================================
//        COG1PHF Bits

extern __at(0x068E) __sfr COG1PHF;

typedef union
  {
  struct
    {
    unsigned PHF0               : 1;
    unsigned PHF1               : 1;
    unsigned PHF2               : 1;
    unsigned PHF3               : 1;
    unsigned PHF4               : 1;
    unsigned PHF5               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G1PHF0             : 1;
    unsigned G1PHF1             : 1;
    unsigned G1PHF2             : 1;
    unsigned G1PHF3             : 1;
    unsigned G1PHF4             : 1;
    unsigned G1PHF5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G1PHF              : 6;
    unsigned                    : 2;
    };

  struct
    {
    unsigned PHF                : 6;
    unsigned                    : 2;
    };
  } __COG1PHFbits_t;

extern __at(0x068E) volatile __COG1PHFbits_t COG1PHFbits;

#define _PHF0                   0x01
#define _G1PHF0                 0x01
#define _PHF1                   0x02
#define _G1PHF1                 0x02
#define _PHF2                   0x04
#define _G1PHF2                 0x04
#define _PHF3                   0x08
#define _G1PHF3                 0x08
#define _PHF4                   0x10
#define _G1PHF4                 0x10
#define _PHF5                   0x20
#define _G1PHF5                 0x20

//==============================================================================


//==============================================================================
//        COG1BLKR Bits

