OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1777.h
extern __at(0x0891) __sfr COG4DBR;

typedef union
  {
  struct
    {
    unsigned DBR0               : 1;
    unsigned DBR1               : 1;
    unsigned DBR2               : 1;
    unsigned DBR3               : 1;
    unsigned DBR4               : 1;
    unsigned DBR5               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G4DBR0             : 1;
    unsigned G4DBR1             : 1;
    unsigned G4DBR2             : 1;
    unsigned G4DBR3             : 1;
    unsigned G4DBR4             : 1;
    unsigned G4DBR5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G4DBR              : 6;
    unsigned                    : 2;
    };

  struct
    {
    unsigned DBR                : 6;
    unsigned                    : 2;
    };
  } __COG4DBRbits_t;

extern __at(0x0891) volatile __COG4DBRbits_t COG4DBRbits;

#define _COG4DBR_DBR0           0x01
#define _COG4DBR_G4DBR0         0x01
#define _COG4DBR_DBR1           0x02
#define _COG4DBR_G4DBR1         0x02
#define _COG4DBR_DBR2           0x04
#define _COG4DBR_G4DBR2         0x04
#define _COG4DBR_DBR3           0x08
#define _COG4DBR_G4DBR3         0x08
#define _COG4DBR_DBR4           0x10
#define _COG4DBR_G4DBR4         0x10
#define _COG4DBR_DBR5           0x20
#define _COG4DBR_G4DBR5         0x20

//==============================================================================


//==============================================================================
//        COG4DBF Bits

extern __at(0x0892) __sfr COG4DBF;

typedef union
  {
  struct
    {
    unsigned DBF0               : 1;
    unsigned DBF1               : 1;
    unsigned DBF2               : 1;
    unsigned DBF3               : 1;
    unsigned DBF4               : 1;
    unsigned DBF5               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G4DBF0             : 1;
    unsigned G4DBF1             : 1;
    unsigned G4DBF2             : 1;
    unsigned G4DBF3             : 1;
    unsigned G4DBF4             : 1;
    unsigned G4DBF5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DBF                : 6;
    unsigned                    : 2;
    };

  struct
    {
    unsigned G4DBF              : 6;
    unsigned                    : 2;
    };
  } __COG4DBFbits_t;

extern __at(0x0892) volatile __COG4DBFbits_t COG4DBFbits;

#define _COG4DBF_DBF0           0x01
#define _COG4DBF_G4DBF0         0x01
#define _COG4DBF_DBF1           0x02
#define _COG4DBF_G4DBF1         0x02
#define _COG4DBF_DBF2           0x04
#define _COG4DBF_G4DBF2         0x04
#define _COG4DBF_DBF3           0x08
#define _COG4DBF_G4DBF3         0x08
#define _COG4DBF_DBF4           0x10
#define _COG4DBF_G4DBF4         0x10
#define _COG4DBF_DBF5           0x20
#define _COG4DBF_G4DBF5         0x20

//==============================================================================


//==============================================================================
//        COG4CON0 Bits

extern __at(0x0893) __sfr COG4CON0;

typedef union
  {
  struct
    {
    unsigned MD0                : 1;
    unsigned MD1                : 1;
    unsigned MD2                : 1;
    unsigned CS0                : 1;
    unsigned CS1                : 1;
    unsigned                    : 1;
    unsigned LD                 : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned G4MD0              : 1;
    unsigned G4MD1              : 1;
    unsigned G4MD2              : 1;
    unsigned G4CS0              : 1;
    unsigned G4CS1              : 1;
    unsigned                    : 1;
    unsigned G4LD               : 1;
    unsigned G4EN               : 1;
    };

  struct
    {
    unsigned G4MD               : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned MD                 : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned                    : 3;
    unsigned G4CS               : 2;
    unsigned                    : 3;
    };

  struct
    {
    unsigned                    : 3;
    unsigned CS                 : 2;
    unsigned                    : 3;
    };
  } __COG4CON0bits_t;

extern __at(0x0893) volatile __COG4CON0bits_t COG4CON0bits;

#define _COG4CON0_MD0           0x01
#define _COG4CON0_G4MD0         0x01
#define _COG4CON0_MD1           0x02
#define _COG4CON0_G4MD1         0x02
#define _COG4CON0_MD2           0x04
#define _COG4CON0_G4MD2         0x04
#define _COG4CON0_CS0           0x08
#define _COG4CON0_G4CS0         0x08
#define _COG4CON0_CS1           0x10
#define _COG4CON0_G4CS1         0x10
#define _COG4CON0_LD            0x40
#define _COG4CON0_G4LD          0x40
#define _COG4CON0_EN            0x80
#define _COG4CON0_G4EN          0x80

//==============================================================================


//==============================================================================
//        COG4CON1 Bits

extern __at(0x0894) __sfr COG4CON1;

typedef union
  {
  struct
    {
    unsigned POLA               : 1;
    unsigned POLB               : 1;
    unsigned POLC               : 1;
    unsigned POLD               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned FDBS               : 1;
    unsigned RDBS               : 1;
    };

  struct
    {
    unsigned G4POLA             : 1;
    unsigned G4POLB             : 1;
    unsigned G4POLC             : 1;
    unsigned G4POLD             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned G4FDBS             : 1;
    unsigned G4RDBS             : 1;
    };
  } __COG4CON1bits_t;

extern __at(0x0894) volatile __COG4CON1bits_t COG4CON1bits;

#define _COG4CON1_POLA          0x01
#define _COG4CON1_G4POLA        0x01
#define _COG4CON1_POLB          0x02
#define _COG4CON1_G4POLB        0x02
#define _COG4CON1_POLC          0x04
#define _COG4CON1_G4POLC        0x04
#define _COG4CON1_POLD          0x08
#define _COG4CON1_G4POLD        0x08
#define _COG4CON1_FDBS          0x40
#define _COG4CON1_G4FDBS        0x40
#define _COG4CON1_RDBS          0x80
#define _COG4CON1_G4RDBS        0x80

//==============================================================================


//==============================================================================
//        COG4RIS0 Bits

extern __at(0x0895) __sfr COG4RIS0;

typedef union
  {
  struct
    {
    unsigned RIS0               : 1;
    unsigned RIS1               : 1;
    unsigned RIS2               : 1;
    unsigned RIS3               : 1;
    unsigned RIS4               : 1;
    unsigned RIS5               : 1;
    unsigned RIS6               : 1;
    unsigned RIS7               : 1;
    };

  struct
    {
    unsigned G4RIS0             : 1;
    unsigned G4RIS1             : 1;
    unsigned G4RIS2             : 1;
    unsigned G4RIS3             : 1;
    unsigned G4RIS4             : 1;
    unsigned G4RIS5             : 1;
    unsigned G4RIS6             : 1;
    unsigned G4RIS7             : 1;
    };
  } __COG4RIS0bits_t;

