OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1777.h
#define _COG4ASD1_AS0E          0x01
#define _COG4ASD1_G4AS0E        0x01
#define _COG4ASD1_AS1E          0x02
#define _COG4ASD1_G4AS1E        0x02
#define _COG4ASD1_AS2E          0x04
#define _COG4ASD1_G4AS2E        0x04
#define _COG4ASD1_AS3E          0x08
#define _COG4ASD1_G4AS3E        0x08
#define _COG4ASD1_AS4E          0x10
#define _COG4ASD1_G4AS4E        0x10
#define _COG4ASD1_AS5E          0x20
#define _COG4ASD1_G4AS5E        0x20
#define _COG4ASD1_AS6E          0x40
#define _COG4ASD1_G4AS6E        0x40
#define _COG4ASD1_AS7E          0x80
#define _COG4ASD1_G4AS7E        0x80

//==============================================================================


//==============================================================================
//        COG4STR Bits

extern __at(0x089F) __sfr COG4STR;

typedef union
  {
  struct
    {
    unsigned STRA               : 1;
    unsigned STRB               : 1;
    unsigned STRC               : 1;
    unsigned STRD               : 1;
    unsigned SDATA              : 1;
    unsigned SDATB              : 1;
    unsigned SDATC              : 1;
    unsigned SDATD              : 1;
    };

  struct
    {
    unsigned G4STRA             : 1;
    unsigned G4STRB             : 1;
    unsigned G4STRC             : 1;
    unsigned G4STRD             : 1;
    unsigned G4SDATA            : 1;
    unsigned G4SDATB            : 1;
    unsigned G4SDATC            : 1;
    unsigned G4SDATD            : 1;
    };
  } __COG4STRbits_t;

extern __at(0x089F) volatile __COG4STRbits_t COG4STRbits;

#define _COG4STR_STRA           0x01
#define _COG4STR_G4STRA         0x01
#define _COG4STR_STRB           0x02
#define _COG4STR_G4STRB         0x02
#define _COG4STR_STRC           0x04
#define _COG4STR_G4STRC         0x04
#define _COG4STR_STRD           0x08
#define _COG4STR_G4STRD         0x08
#define _COG4STR_SDATA          0x10
#define _COG4STR_G4SDATA        0x10
#define _COG4STR_SDATB          0x20
#define _COG4STR_G4SDATB        0x20
#define _COG4STR_SDATC          0x40
#define _COG4STR_G4SDATC        0x40
#define _COG4STR_SDATD          0x80
#define _COG4STR_G4SDATD        0x80

//==============================================================================


//==============================================================================
//        CM4CON0 Bits

extern __at(0x090C) __sfr CM4CON0;

typedef union
  {
  struct
    {
    unsigned SYNC               : 1;
    unsigned HYS                : 1;
    unsigned Reserved           : 1;
    unsigned ZLF                : 1;
    unsigned POL                : 1;
    unsigned                    : 1;
    unsigned OUT                : 1;
    unsigned ON                 : 1;
    };

  struct
    {
    unsigned C4SYNC             : 1;
    unsigned C4HYS              : 1;
    unsigned C4SP               : 1;
    unsigned C4ZLF              : 1;
    unsigned C4POL              : 1;
    unsigned                    : 1;
    unsigned C4OUT              : 1;
    unsigned C4ON               : 1;
    };
  } __CM4CON0bits_t;

extern __at(0x090C) volatile __CM4CON0bits_t CM4CON0bits;

#define _CM4CON0_SYNC           0x01
#define _CM4CON0_C4SYNC         0x01
#define _CM4CON0_HYS            0x02
#define _CM4CON0_C4HYS          0x02
#define _CM4CON0_Reserved       0x04
#define _CM4CON0_C4SP           0x04
#define _CM4CON0_ZLF            0x08
#define _CM4CON0_C4ZLF          0x08
#define _CM4CON0_POL            0x10
#define _CM4CON0_C4POL          0x10
#define _CM4CON0_OUT            0x40
#define _CM4CON0_C4OUT          0x40
#define _CM4CON0_ON             0x80
#define _CM4CON0_C4ON           0x80

//==============================================================================


//==============================================================================
//        CM4CON1 Bits

extern __at(0x090D) __sfr CM4CON1;

typedef union
  {
  struct
    {
    unsigned INTN               : 1;
    unsigned INTP               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C4INTN             : 1;
    unsigned C4INTP             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __CM4CON1bits_t;

extern __at(0x090D) volatile __CM4CON1bits_t CM4CON1bits;

#define _CM4CON1_INTN           0x01
#define _CM4CON1_C4INTN         0x01
#define _CM4CON1_INTP           0x02
#define _CM4CON1_C4INTP         0x02

//==============================================================================


//==============================================================================
//        CM4NSEL Bits

extern __at(0x090E) __sfr CM4NSEL;

typedef union
  {
  struct
    {
    unsigned C4NCH0             : 1;
    unsigned C4NCH1             : 1;
    unsigned C4NCH2             : 1;
    unsigned C4NCH3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C4NCH              : 4;
    unsigned                    : 4;
    };
  } __CM4NSELbits_t;

extern __at(0x090E) volatile __CM4NSELbits_t CM4NSELbits;

#define _C4NCH0                 0x01
#define _C4NCH1                 0x02
#define _C4NCH2                 0x04
#define _C4NCH3                 0x08

//==============================================================================


//==============================================================================
//        CM4PSEL Bits

extern __at(0x090F) __sfr CM4PSEL;

typedef union
  {
  struct
    {
    unsigned PCH0               : 1;
    unsigned PCH1               : 1;
    unsigned PCH2               : 1;
    unsigned PCH3               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C4PCH0             : 1;
    unsigned C4PCH1             : 1;
    unsigned C4PCH2             : 1;
    unsigned C4PCH3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PCH                : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned C4PCH              : 4;
    unsigned                    : 4;
    };
  } __CM4PSELbits_t;

